'use strict'
console.log(alert('Часть заданий внутри файла JS'));

// ===================================================================
// ДОМАШКА #1
// ===================================================================
/* 
Создать новый проект, подключить к нему файл script.js и
в строгом режиме ввывести в консоль фразу "Я учу JS"
*/

console.log('Я учу JS');

// Написать какой вариант вызовет ошибку
/*
Вариант №1
console.log('Учим JS');

Вариант №2
console.log('JS');
console.log('Учим');

Вариант №3
console.log('Учим') console.log('JS');

Вариант №4
console.log('Учим);
console.log('JS');
*/


// ===================================================================
// ДОМАШКА #2
// ===================================================================
/*
1. Придумать имя переменной для хранения цвета
	глаз пользователя сайта
2. Объявить две переменные - user и userName
	Присвоить значение "Вася" переменной userName
	Скопировать значение переменной userName в переменную user
	Вывести в консоль переменную user. Результат должен быть Вася
*/
let userEyesColor;
let user, userName;
userName = 'Вася';
user = userName;
console.log(user);

// Написать какой вариант вызовет ошибку
/*
Вариант №1
let user = 'Вася' let age = 36

Вариант №2
let myage = 36;

Вариант №3
const BLOCK_SIZE = 14 + 50;

Вариант №4
const BLOCK_HEIGHT = 100;

Вариант №5
if (true) {
	var size = 15;
}
console.log(size);
 */

// ===================================================================
// ДОМАШКА #3
// ===================================================================

// Какой или какие из вариантов не верны
/* 
Вариант №1
let userAge = 36;
let userInfo = "Фрилансер ${userAge}";

Вариант №2
let userHeight = 145 / 0;
Вернется значение NaN
console.log(userHeight);

Вариант №3
let userName;
Вернется тип данных Null
console.log(typeof userName);

Вариант №4
let userSize = "45" / "8";
Вернется тип данных Number
console.log(typeof userSize);
 */
